{"pageProps":{"postData":{"id":"education/social/psychology/rmit/foai/week-2","title":"FoAI - Week 2","date":"2025-06-30","contentHtml":"<h2>Table of Contents</h2>\n<ul>\n<li><a href=\"#table-of-contents\">Table of Contents</a></li>\n<li><a href=\"#ai-past-and-present\">AI: Past and Present</a>\n<ul>\n<li><a href=\"#the-story-of-ai\">The Story of AI</a></li>\n<li><a href=\"#state-of-the-art-ai-applications\">\"State Of The Art\" AI Applications</a></li>\n<li><a href=\"#review\">Review</a></li>\n</ul>\n</li>\n</ul>\n<h2>AI: Past and Present</h2>\n<h3>The Story of AI</h3>\n<ul>\n<li>AI: A Journey of Breakthroughs and Setbacks\n<ul>\n<li>Dartmouth workshop (1956): In the aftermath of World War II, rapid advancements in computing, cryptography, and automation fueled a new era of technological ambition. Scientists began asking: Could machines not only calculate but also think? Influenced by cybernetics (how systems regulate themselves) and Alan Turing’s theories on machine intelligence, a young mathematician, John McCarthy, believed the time had come to make this question a formal scientific pursuit. In the summer of 1956, he gathered leading minds at Dartmouth College, launching the first official study of Artificial Intelligence.</li>\n<li>The 1st Wave - Great Expectations (1950s, 1960s):\n<ul>\n<li>Fueled by the excitement of possibility, researchers began teaching computers to do things once thought uniquely human - playing games, solving math problems, and even recognising patterns. The results were promising.</li>\n<li>Lisp programming language for AI (McCarthy, 1958)</li>\n<li>Checkers program (Samuel, 1959)</li>\n<li>Perceptron machines (Rosenblatt, 1957-1962, one of the first artificial neural networks)</li>\n</ul>\n</li>\n<li>The 1st Winter - A Dose of Reality (1970s):\n<ul>\n<li>The dream hit a wall. AI, as it turned out, was much harder than expected. While machines could play chess, they struggled with tasks toddlers found easy - like recognising objects or understanding simple spoken commands. This led to critiques &#x26; funding cut-off.</li>\n<li>Limited computational power made ambitious AI ideas impossible to implement.</li>\n<li>Complex problems, such as language and real-world reasoning, were too difficult for the existing technology.</li>\n<li>Moravec’s Paradox became clear: what was hard for humans (chess, logic) was easy for AI, but what was easy for humans (vision, movement) was incredibly hard for machines.</li>\n</ul>\n</li>\n<li>The 2nd Wave - Expert Systems (1970s, 1980s):\n<ul>\n<li>Then came a new approach - if AI couldn’t think like a human, perhaps it could at least act like one in specific fields. The era of expert systems began - programs that answer questions about a specific domain, using logical rules derived from knowledge of experts.</li>\n<li>DENDRAL (1969) – Helped chemists identify molecular structures.</li>\n<li>MYCIN (1972) – Assisted doctors in diagnosing bacterial infections.</li>\n<li>XCON (1978) – Helped configure complex computer systems for industry.</li>\n</ul>\n</li>\n<li>The 2nd Winter - Brittle Systems (1980s, 1990s):\n<ul>\n<li>Expert systems are difficult to build and maintain for complex domains. AI, once again, seemed stuck.</li>\n<li>Too much manual effort was needed to update AI systems.</li>\n<li>They couldn’t handle uncertainty - anything outside their predefined rules confused them.</li>\n<li>Many declared AI a failed experiment. For the second time, AI research nearly disappeared.</li>\n</ul>\n</li>\n<li>The 3rd Wave - Deep Learning (1990s - present):\n<ul>\n<li>But AI wasn’t dead - it was evolving! More data, faster computers, &#x26; advanced learning techniques have led to a resurgence of neural networks.</li>\n<li>IBM’s Deep Blue (1997) – The AI that defeated chess champion Garry Kasparov.</li>\n<li>IBM's Watson (2011) – An AI that could understand human language well enough to win Jeopardy!, marking a leap in natural language processing.</li>\n<li>Google’s AlphaGo (2015) – Using reinforcement learning to surpass human players.</li>\n<li>OpenAI's ChatGPT (2022) – A generative AI that could hold conversations, write essays, and even create art, transforming the way people interact with machines.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The Story of AI through Chess\n<ul>\n<li>1997: Deep Blue vs. Kasparov - IBM’s Deep Blue defeated World Chess Champion Garry Kasparov, marking the first time an AI outperformed the best human player. Many feared this would harm chess by diminishing interest and sponsorship.</li>\n<li>2000s–2010s: AI Enhancing Chess - Contrary to concerns, AI helped chess grow. Advanced engines allowed players worldwide to train more effectively, study new strategies, and access high-quality analysis. Chess became more popular than ever.</li>\n<li>2010s–2020s: AI Shaping Human Play - AlphaGo defeated top human players in 2016-2017. This led to a transformation - with human using AI insights to refine their strategies, while AI continues learning from human games, refining its understanding of strategy and tactics.</li>\n<li>2020s–Future: Broader Lessons for AI - The chess-AI evolution is a model for other fields. AI is not replacing humans outright but is instead improving human capabilities. Success now depends on knowing how to collaborate with AI.</li>\n</ul>\n</li>\n</ul>\n<h3>\"State Of The Art\" AI Applications</h3>\n<ul>\n<li>AI in Computer Vision: Be My Eyes\n<ul>\n<li>The Be My Eyes app was originally designed to connect blind and low-vision users with sighted volunteers for real-time assistance.</li>\n<li>But now they have integrated OpenAI’s GPT-4 Turbo with Vision to provide instant, autonomous visual interpretation.</li>\n<li>Users can take a picture or use their phone's camera, and the AI describes what it sees - whether it's reading labels, navigating unfamiliar environments, or identifying objects.</li>\n<li>This AI-powered tool is transforming accessibility by offering on-demand independence, reducing reliance on volunteers, and making everyday tasks more seamless for visually impaired users.</li>\n<li>It’s a great example of how AI can empower people and improve lives.</li>\n</ul>\n</li>\n<li>Case study: Food waste and how AI can reduce it\n<ul>\n<li>While food is biodegradable, food waste has caused immense impacts on the environment, including climate change, wasted resources, food insecurity, and economic losses.</li>\n<li>Technological advancements HAVE NOT YET been able to compensate for these losses.</li>\n<li>That's why it’s important to consider solutions, either on the individual level or go beyond it to address the issue on a larger scale, impacting systems and industries as a whole.</li>\n<li>Solution: DUB AI uses machine learning to synthesise daily food waste data in the bin and help inform kitchens the most efficient food input.</li>\n</ul>\n</li>\n<li>AI Applications in various fields</li>\n</ul>\n<h3>Review</h3>\n<ul>\n<li>The Dartmouth Workshop in 1956 is considered the birthplace of AI as an academic field. It was where researchers formally proposed that machines could simulate human intelligence, shaping the direction of AI research.</li>\n<li>Early AI research in the 1950s and 1960s focused on tasks that demonstrated human-like intelligence, such as playing chess and solving mathematical problems, as these were easier to model computationally at the time.</li>\n<li>During the 1970s, AI research struggled due to the limitations of computing power and difficulties in solving complex problems. This led to reduced funding and slower progress, contributing to an \"AI winter.\"</li>\n<li>The first AI winter happened because of skepticism from researchers and policymakers, leading to reduced funding and stalled progress. Unrealistic expectations had led to disappointment when AI failed to deliver on its early promises.</li>\n<li>AI taxonomy is the categorization of AI systems based on their capabilities and functionalities. It helps in understanding different types of AI, such as narrow AI, general AI, or super AI.</li>\n</ul>\n"},"relatedPosts":[{"id":"education/social/psychology/rmit/foai/week-1","title":"FoAI - Week 1","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-2","title":"FoAI - Week 2","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-3","title":"FoAI - Week 3","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-4","title":"FoAI - Week 4","date":"2025-06-30"},{"id":"education/universities","title":"Universities","date":"2025-05-19"},{"id":"education/degrees","title":"Academic Degrees","date":"2025-05-03"},{"id":"education/social/economics","title":"Economics","date":"2025-05-01"},{"id":"education/social/psychology/master","title":"Master in Psychology","date":"2025-05-01"},{"id":"education/online","title":"Online Education","date":"2025-05-01"}]},"__N_SSG":true}