{"pageProps":{"postData":{"id":"education/social/psychology/rmit/foai/week-4","title":"FoAI - Week 4","date":"2025-06-30","contentHtml":"<h2>Table of Contents</h2>\n<ul>\n<li><a href=\"#table-of-contents\">Table of Contents</a></li>\n<li><a href=\"#introduction-to-machine-learning-and-deep-learning\">Introduction to Machine Learning and Deep Learning</a>\n<ul>\n<li><a href=\"#what-is-machine-learning\">What is Machine Learning?</a></li>\n<li><a href=\"#types-of-machine-learning\">Types of Machine Learning</a></li>\n<li><a href=\"#review-and-reflect\">Review and Reflect</a></li>\n</ul>\n</li>\n</ul>\n<h2>Introduction to Machine Learning and Deep Learning</h2>\n<h3>What is Machine Learning?</h3>\n<ul>\n<li>Tom Mitchell offered a more precise definition in 1998 that helps us break down exactly what happens in machine learning:\n<ul>\n<li>This definition gives us a framework with three essential components:\n<ul>\n<li>Task (T): What the model is trying to do</li>\n<li>Experience (E): The data the model learns from</li>\n<li>Performance measure (P): How we evaluate how well the model is doing</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Popular Performance Measures\n<ul>\n<li>The performance measure we choose dramatically affects what kind of system we end up with - even when using the same data and algorithms! Depending on the task, we can use different performance measures:\n<ul>\n<li>For Regression: These measures evaluate models that predict continuous values (like prices, temperatures, etc.)</li>\n<li>For Classification: These measures evaluate models that predict categorical outcomes (like spam/not spam, positive/negative)</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Training data (also called training set) is the foundational dataset used to teach machine learning models to recognise patterns.\n<ul>\n<li>A training set is typically structured as a table or matrix:\n<ul>\n<li>Each row is a sample (also called a data point or an instance)</li>\n<li>Each column is a feature (also called an attribute)</li>\n</ul>\n</li>\n<li>For binary classification problems, the label represents the target outcome: Label = 0 (no/negative) or 1 (yes/positive).</li>\n</ul>\n</li>\n<li>Quiz\n<ul>\n<li>What does each row in a training dataset typically represent? A data point or instance</li>\n<li>What is a feature in a training dataset? A column representing an attribute like age or BMI</li>\n<li>Training data is used to teach the model to recognize patterns and relationships.</li>\n<li>The column “Label” represents whether the patient has diabetes (1 = yes, 0 = no)</li>\n<li>Which of the following is an example of a feature from the example dataset? DiabetesPedigree</li>\n<li>Which of the following is an example of a sample from the example dataset? P004</li>\n</ul>\n</li>\n</ul>\n<h3>Types of Machine Learning</h3>\n<ul>\n<li>Supervised learning is often considered the most powerful approach in machine learning, particularly for well-defined problems where we have labelled examples. The term \"supervised\" refers to the learning process being guided or \"supervised\" by known correct answers.\n<ul>\n<li>Classification: When we predict categories or classes e.g. diagnoses where Label: Diabetes Present (1) or Absent (0)</li>\n<li>Regression: When we predict continuous numerical values e.g. House Price Prediction where Label = Sale price ($350,000, $175,000, etc.)</li>\n</ul>\n</li>\n<li>Unsupervised learning finds structure in data without being told what to look for. Two most common tasks in unsupervised learning are clustering and anomaly detection. Have a look at the case studies below to understand them.\n<ul>\n<li>Clustering Case Study - Customer Grouping\n<ul>\n<li>Older customers who spend a lot</li>\n<li>Middle-aged/older customers who spend a medium amount</li>\n<li>Younger customers who spend very little</li>\n</ul>\n</li>\n<li>Anomaly Detection Case Study - Banking Security\n<ul>\n<li>The system learns what normal transaction patterns look like for each customer</li>\n<li>Transactions that deviate significantly from these patterns trigger alerts</li>\n<li>This helps identify potentially fraudulent activity without needing examples of fraud.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Reinforcement Learning: Have you ever learned a new skill through practice and feedback? Maybe you learned to ride a bike by trying, falling, adjusting, and trying again. Reinforcement learning works similarly - it's learning through experience and feedback.\n<ul>\n<li>Observe: The agent perceives the current state of the environment</li>\n<li>Select action: Based on a policy (strategy), the agent chooses an action</li>\n<li>Take action: The agent performs the chosen action</li>\n<li>Get reward or penalty: The environment provides feedback</li>\n<li>Update policy (learning step): The agent adjusts its strategy based on feedback</li>\n<li>Iterate: This cycle continues until an optimal policy is found.</li>\n</ul>\n</li>\n</ul>\n<h3>Review and Reflect</h3>\n<ul>\n<li>RMSE (Root Mean Squared Error) and R-squared are standard metrics used to evaluate how well a regression model fits continuous numerical data.</li>\n<li>These three core types describe how AI models learn: with labels, without labels, or through feedback from interaction.</li>\n<li>Supervised learning relies on labeled input-output pairs to train models to make predictions or decisions.</li>\n<li>K-Means is an unsupervised clustering algorithm, not used in supervised learning tasks.</li>\n<li>Unsupervised learning is used to detect structure in data without labels, such as grouping or reducing features.</li>\n<li>Reinforcement learning uses trial and error, where agents learn through feedback based on actions taken in an environment.</li>\n</ul>\n"},"relatedPosts":[{"id":"education/social/psychology/rmit/foai/week-1","title":"FoAI - Week 1","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-2","title":"FoAI - Week 2","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-3","title":"FoAI - Week 3","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-4","title":"FoAI - Week 4","date":"2025-06-30"},{"id":"education/universities","title":"Universities","date":"2025-05-19"},{"id":"education/social/psychology/master","title":"Master in Psychology","date":"2025-05-01"}]},"__N_SSG":true}