{"pageProps":{"postData":{"id":"education/social/psychology/rmit/foai/week-1","title":"FoAI - Week 1","date":"2025-06-30","contentHtml":"<h2>Table of Contents</h2>\n<ul>\n<li><a href=\"#table-of-contents\">Table of Contents</a></li>\n<li><a href=\"#ai-approaches\">AI Approaches</a>\n<ul>\n<li><a href=\"#approaches-to-ai-development\">Approaches to AI Development</a></li>\n<li><a href=\"#explore-key-ai-concepts\">Explore Key AI Concepts</a></li>\n<li><a href=\"#review\">Review</a></li>\n</ul>\n</li>\n</ul>\n<h2>AI Approaches</h2>\n<h3>Approaches to AI Development</h3>\n<ul>\n<li>According to a survey from Pega Links to an external site. of 6,000 consumers, only 33% of people think that they use AI, while 77% use an AI-powered service or device. You may be surprised to learn that AI can be anything from advanced robotics to the Google search function you use daily. Click here to learn more about common uses and applications of AI. Links to an external site.</li>\n<li>AI in Assistive Technology\n<ul>\n<li>One of the major applications of AI is in assistive technology, making everyday tasks more accessible for people with disabilities. From screen readers that use natural language processing to describe text and images, to AI-powered hearing aids that filter background noise, these innovations enhance independence and inclusion.</li>\n<li>Speech recognition tools help those with mobility impairments control devices hands-free, while computer vision enables devices to identify objects and read signs for the visually impaired.</li>\n<li>By continuously learning and adapting, these innovations are breaking barriers, fostering independence, and making the world more inclusive.</li>\n</ul>\n</li>\n<li>AI is shaping a lot of our everyday interactions. But not everything that looks “smart” is actually AI.\n<ul>\n<li>Not really - Calculators follow pre-programmed rules. They process input using fixed mathematical operations, not machine learning or decision-making.</li>\n<li>Yes, it learns and improves over time. Google Translate uses deep learning models to analyse language patterns and improve translations dynamically.</li>\n<li>No, it follows predefined banking rules. ATMs authenticate users and process transactions based on fixed rules. While banks use AI for fraud detection, a standard ATM does not have AI-driven decision-making.</li>\n<li>Yes, it predicts and adjusts text based on patterns. Autocorrect systems use machine learning to suggest and correct words based on past typing behavior.</li>\n<li>Yes, it maps and adapts to room layouts. Modern robot vacuums use AI-powered sensors and mapping algorithms to navigate efficiently.</li>\n<li>It depends - some advanced systems do, while traditional ones don’t. Basic traffic lights operate on fixed schedules, but smart traffic management systems use AI to optimise flow based on real-time data.</li>\n</ul>\n</li>\n<li>AI (Artificial Intelligence) can be developed in different ways, depending on how we define \"intelligence\":\n<ul>\n<li>Metrics\n<ul>\n<li>Characteristics of intelligence: humanly and rationally</li>\n<li>How it manifests: through thinking or acting</li>\n</ul>\n</li>\n<li>Grid\n<ul>\n<li>Acting Humanly (The Turing Test Approach)\n<ul>\n<li>AI mimics human behaviour, aiming to convince users it’s human (e.g., chatbots, NLP).</li>\n<li>Limitation: Acting human doesn’t mean true understanding - AI may imitate without real intelligence.</li>\n</ul>\n</li>\n<li>Acting Rationally\n<ul>\n<li>AI makes optimal decisions based on goals and environmental conditions (e.g., self-driving cars, recommendation systems).</li>\n<li>Limitation: Lacks human intuition and ethics; defining \"rational\" can be complex in real-world scenarios.</li>\n</ul>\n</li>\n<li>Thinking Humanly\n<ul>\n<li>AI models human cognitive processes like perception, reasoning, and learning.</li>\n<li>Limitation: Human thinking is complex, sometimes irrational, and not fully understood.</li>\n</ul>\n</li>\n<li>Thinking Rationally\n<ul>\n<li>AI uses logic and probability to make rational decisions.</li>\n<li>Limitation: Real-world data is often uncertain or incomplete, making strict logical reasoning impractical.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Most Effective\n<ul>\n<li>The Act Rationally approach is often considered the most effective and practical, because it's more flexible than strict logic-based reasoning (Thinking Rationally), it avoids human thought's biases (Thinking/Acting Humanly), and it can adapt and learn from changing environments to achieve the best outcome.</li>\n<li>However, each approach of the four above has its strengths and weaknesses. Depending on the type and aim of the technology, one approach will be more suitable than the others. In reality, many modern AI systems combine multiple approaches to be more effective.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Quiz\n<ul>\n<li>Acting Rationally. Self-driving cars rely on sensors, real-time data processing, and decision-making algorithms to navigate roads safely. They don’t need to think like humans but must act rationally based on optimal driving strategies.</li>\n<li>Virtual assistants respond to voice commands and engage in human-like interactions (Acting Humanly). They also process information and make decisions efficiently (Acting Rationally), such as setting reminders or answering questions.</li>\n<li>Chess AI doesn’t need human-like thought but relies on logical computation to predict optimal moves (Thinking Rationally).</li>\n<li>Surgical robots follow \"Thinking Rationally\" (to predict patient outcomes, enhance imaging, and refine robotic movements) and \"Acting Rationally\" (implement precise, controlled movements based on real-time data).</li>\n<li>Education AI assesses student learning needs and adapts instruction logically (Thinking Rationally). It also interacts in a way that mimics human tutors, offering personalized feedback and engagement (Acting Humanly).</li>\n<li>A cleaning robot doesn’t \"think\" like a human but uses data, sensors, and AI models to optimize cleaning routes and tasks (Acting Rationally). It follows logical steps to complete its tasks efficiently rather than mimicking human thought or interaction.</li>\n</ul>\n</li>\n</ul>\n<h3>Explore Key AI Concepts</h3>\n<ul>\n<li>Quiz\n<ul>\n<li>AI is a broad field focused on solving problems autonomously by simulating human intelligence. While AI can power chatbots and self-driving cars, it’s not limited to them.</li>\n<li>AI is the overarching field, Machine Learning is a subset of AI, and Deep Learning is a specialized subset of Machine Learning.</li>\n<li>Neural networks in deep learning are inspired by the human brain and help AI models process more complex, unstructured data (image, audio, video, speech) while minimising errors.</li>\n<li>Deep learning has become more powerful due to advances in computing and access to large datasets. This has enabled AI to handle more complex tasks.</li>\n<li>Only Virtual assistants use AI, the others are just rule-based technology. Alexa integreates LLMs to improve their natural language understanding and responses.</li>\n</ul>\n</li>\n<li>While AI is the grand vision of intelligent machines...\n<ul>\n<li>Machine learning consists of the models, processes, and supporting technology that we’ve been using to get there.</li>\n<li>Deep learning is machine learning at the largest scale, involving millions of instances of training data and often multiple layers within the neural network.</li>\n<li>A neural network is a collection of algorithms designed to take in data and find a solution with the least amount of error. (You can see an illustration on the right - a neuron network simulates the complex neuron connections in the human brain.)</li>\n</ul>\n</li>\n</ul>\n<h3>Review</h3>\n<ul>\n<li>Level\n<ul>\n<li>Rule-Based Systems (Traditional Programming/Early AI)\n<ul>\n<li>Early AI relied on explicitly programmed rules (if-then statements).</li>\n<li>These systems couldn’t learn or adapt - they only followed predefined logic.</li>\n<li>Example: Expert systems, early chatbots like ELIZA.</li>\n</ul>\n</li>\n<li>Machine Learning (ML)\n<ul>\n<li>Instead of relying on fixed rules, ML systems learn patterns from data.</li>\n<li>They improve with experience but still require structured input and human feature selection.</li>\n<li>Example: Spam filters that learn to detect spam based on previous emails.</li>\n</ul>\n</li>\n<li>Deep Learning (DL)\n<ul>\n<li>DL is a subset of ML that uses neural networks to process unstructured data like images, videos, text, and speech.</li>\n<li>Unlike ML, it automatically finds patterns without manual feature selection.</li>\n<li>Example: Facial recognition, self-driving cars detecting objects.</li>\n</ul>\n</li>\n<li>Large Language Models (LLMs)\n<ul>\n<li>LLMs are a specialised form of DL, trained on massive text datasets using transformer architectures (e.g., GPT).</li>\n<li>They generate human-like responses, understand context, and perform complex language tasks.</li>\n<li>Example: ChatGPT, Google Bard, AI-assisted coding tools like GitHub Copilot.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Types of AI\n<ul>\n<li>Capabilities\n<ul>\n<li>Narrow AI (Weak AI) – The only AI that exists today, trained for specific tasks.</li>\n<li>General AI (AGI or Strong AI) – A theoretical AI that can apply learning across different contexts.</li>\n<li>Super AI – A hypothetical AI surpassing human intelligence, capable of independent reasoning and emotions.</li>\n</ul>\n</li>\n<li>Functionalities\n<ul>\n<li>Reactive AI – Performs specialized tasks based on data without learning from past experiences (e.g., IBM's Deep Blue).</li>\n<li>Limited Memory AI – Can recall past data and improve performance over time (e.g., generative AI like ChatGPT).</li>\n<li>Theory of Mind AI (Emotion AI) – A developing AI concept that aims to understand and respond to human emotions.</li>\n<li>Self-Aware AI – A hypothetical AI with its own emotions, beliefs, and self-awareness.</li>\n</ul>\n</li>\n<li>3 types of AI that actually exist today are: Narrow AI: The AI we currently use, trained for specific tasks. Narrow AI includes: Reactive AI (AI that processes information without learning from the past), and Limited Memory AI (AI that learns from past data to improve performance). Everything else is theoretical or in development.</li>\n</ul>\n</li>\n</ul>\n"},"relatedPosts":[{"id":"education/social/psychology/rmit/foai/week-1","title":"FoAI - Week 1","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-2","title":"FoAI - Week 2","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-3","title":"FoAI - Week 3","date":"2025-06-30"},{"id":"education/social/psychology/rmit/foai/week-4","title":"FoAI - Week 4","date":"2025-06-30"},{"id":"education/universities","title":"Universities","date":"2025-05-19"},{"id":"education/social/psychology/master","title":"Master in Psychology","date":"2025-05-01"},{"id":"education/online","title":"Online Education","date":"2025-05-01"}]},"__N_SSG":true}